import random
import uuid
from typing import Generator

import json
from src.config import app_config


def generate_random_data() -> Generator[dict[str, str | int]]:
    """
    Генератор для создания фейковых книг.
    """
    # Список случайных слов для заголовков
    # fmt: off
    titles = [
        "Мечта", "Приключение", "Тайна", "Путешествие", "Секрет",
        "Жизнь", "Любовь", "Свет", "Тьма", "Звёзды",
        "Легенда", "Судьба", "Ветер", "Океан", "Дорога",
        "Борьба", "Надежда", "Полёт", "Пламя", "Сказка",
        "Шторм", "Берег", "Вершина", "Лес", "Город",
        "Озеро", "Волна", "Горизонт", "Вдохновение", "Истина",
        "Грёза", "Ключ", "Бесконечность", "Мост", "Портал",
        "Река", "Тропа", "Песня", "Магия", "Слово",
        "Крыло", "Братство", "Меч", "Щит", "Сердце",
        "Корона", "Печать", "Рассвет", "Закат", "Воспоминание"
    ]

    # Список русских фамилий
    surnames = [
        "Иванов", "Петров", "Сидоров", "Кузнецов", "Смирнов",
        "Попов", "Соколов", "Михайлов", "Фёдоров", "Морозов",
        "Волков", "Зайцев", "Соловьёв", "Егоров", "Павлов",
        "Пастухов", "Романов", "Карпов", "Алексеев", "Николаев",
        "Васильев", "Гордеев", "Лебедев", "Степанов", "Матвеев",
        "Беляев", "Миронов", "Жуков", "Орлов", "Сергеев",
        "Фролов", "Тихонов", "Крылов", "Гаврилов", "Рыбаков",
        "Логинов", "Осипов", "Макаров", "Денисов", "Григорьев",
        "Горшков", "Копылов", "Мартынов", "Лазарев", "Борисов",
        "Чернов", "Куликов", "Мельников", "Давыдов", "Буров"
    ]
    # fmt: on

    # Русские инициалы
    initials_letters = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"

    while True:
        # Генерация случайного UUID для поля id
        id_value = uuid.uuid4().hex

        # Генерация случайного заголовка
        title = f"{random.choice(titles)} {random.choice(titles).lower()}"

        # Генерация случайного автора в формате "Фамилия И. О."
        initials = (
            f"{random.choice(initials_letters)}. {random.choice(initials_letters)}."
        )
        author = f"{random.choice(surnames)} {initials}"

        # Генерация случайного года
        year = random.randint(1900, 2020)

        # Генерация случайного статуса
        status = random.choice(["В наличии", "Выдана"])

        # Формирование итогового словаря
        yield {
            "id": id_value,
            "title": title,
            "author": author,
            "year": year,
            "status": status,
        }


if __name__ == "__main__":
    data_generator = generate_random_data()
    books = {}
    for i in range(1, 10_000):
        book = next(data_generator)
        books[book["id"]] = book

        if i % 1000 == 0:
            print("Готово", i, "книг.")

    with open(app_config.data_file, "w", encoding="utf-8") as json_file:
        json.dump(books, json_file, indent=4, ensure_ascii=False)
